In [1]:
import pandas as pd
import numpy as np

データを読み込む

In [10]:
df = pd.DataFrame({
    'city': ['osaka', 'osaka', 'osaka', 'osaka', 'tokyo', 'tokyo', 'tokyo'],
    'food': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
})
df

    city    food  price  quantity
0  osaka   apple    100         1
1  osaka  orange    200         2
2  osaka  banana    250         3
3  osaka  banana    300         4
4  tokyo   apple    150         5
5  tokyo   apple    200         6
6  tokyo  banana    400         7

In [3]:
df.columns

Index(['city', 'food', 'price', 'quantity'], dtype='object')

In [4]:
df.index

RangeIndex(start=0, stop=7, step=1)

`groupbye`を利用してカラムごとの集計を行う

In [5]:
df.groupby('city').agg('mean')

       price  quantity
city
osaka  212.5       2.5
tokyo  250.0       6.0

複数グループラベルを指定することも可能

In [9]:
df.groupby(['city', 'food']).agg('mean')

              price  quantity
city  food
osaka apple   100.0       1.0
      banana  275.0       3.5
      orange  200.0       2.0
tokyo apple   175.0       5.5
      banana  400.0       7.0

`groupby`すると勝手にグループラベルが`index`になってしまう。グループラベルをカラムにしたい場合は、`as_index=False`を指定する。

In [6]:
df.groupby('city', as_index=False).agg('mean')

    city  price  quantity
0  osaka  212.5       2.5
1  tokyo  250.0       6.0

In [8]:
df.groupby(['city', 'food'], as_index=False).agg('mean')

    city    food  price  quantity
0  osaka   apple  100.0       1.0
1  osaka  banana  275.0       3.5
2  osaka  orange  200.0       2.0
3  tokyo   apple  175.0       5.5
4  tokyo  banana  400.0       7.0

ラベルの変更

In [11]:
df

    city    food  price  quantity
0  osaka   apple    100         1
1  osaka  orange    200         2
2  osaka  banana    250         3
3  osaka  banana    300         4
4  tokyo   apple    150         5
5  tokyo   apple    200         6
6  tokyo  banana    400         7

In [12]:
df.rename(columns={'quantity':'quality'})

    city    food  price  quality
0  osaka   apple    100        1
1  osaka  orange    200        2
2  osaka  banana    250        3
3  osaka  banana    300        4
4  tokyo   apple    150        5
5  tokyo   apple    200        6
6  tokyo  banana    400        7

In [13]:
df

    city    food  price  quantity
0  osaka   apple    100         1
1  osaka  orange    200         2
2  osaka  banana    250         3
3  osaka  banana    300         4
4  tokyo   apple    150         5
5  tokyo   apple    200         6
6  tokyo  banana    400         7